app/Http/Controllers/NiveauController.php

select * from `filieres` where `filieres`.`id` in (4)
---
    public function classes($filiere, $id)

    {
        $filieres = filiere::pluck('nom', 'id');
        $niveaux = Niveau::pluck('nom', 'id');
        $classes = classe::where('niveau_id',$id)->where('filiere_id', $filiere)->with(['filiere','niveau'])->get();